using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class DZ : MonoBehaviour
{
/*    
    1. персонаж
    2. предметы дл€ собирани€ - €блоки, коробки, зель€
        2.1 при собирании предметы добавл€ютс€ в список и исчезают со сцены
        2.1.1 список предметов это приватное поле
        2.1.2 при обращении к нему извне список каститс€ в массив List.ToArray

    3. при собирании эффект срабатывает  в направлении где был предмет
        3.1 система частиц св€зана только с игроком
        3.2 система частиц подписана на событи€, о которых игрок не знает (собирание)
*/
}
